{
  "header-name-1": "Zetseat",
  "header-name-2": "Apostolic",
  "header-name-3": "Reformation",
  "header-name-4": "Church",
  "pre-header-title": "zetseat church",
  "pre-header-motto": "To see a generation suitable to God risen in the whole world",
  "footer.address": "Address",
  "footer.location": "Sarbet, Next to Oromia Offices Addis Ababa, Ethiopia",
  "footer.direction": "Get Directions",
  "footer.mail": "Mail",
  "footer.phone": "Phone",
  "footer.phones": "Phones",
  "footer.email": "Email",
  "footer.emails": "Emails",
  "nav.home.name": "home",
  "nav.home.description": "Zetseat Church homepage.",
  "nav.blog.name": "blog",
  "nav.blog.description": "Browse and read articles.",
  "nav.podcasts.name": "podcasts",
  "nav.podcasts.description": "Browse and listen to podcasts.",
  "nav.videos.name": "zetseat tv",
  "nav.videos.description": "Browse and play video series.",
  "nav.about.name": "about us",
  "nav.about.description": "Know more about Zetseat Church.",
  "nav.shop.name": "shop",
  "nav.shop.description": "Shop from Zetseat Church.",
  "nav.give.name": "give",
  "nav.give.description": "Give a Thank You offering.",
  "nav.live.name": "live",
  "nav.live.description": "Watch Zetseat TV live.",
  "nav.events.name": "events",
  "nav.events.description": "Browse and discover planned events.",
  "nav.youth.name": "youth",
  "nav.youth.description": "Youth at Zetseat Church.",
  "nav.kids.name": "kids",
  "nav.kids.description": "Kids at Zetseat Church.",
  "home.lead.title": "house of worship",
  "home.lead.description": "To see a generation suitable to God risen in the whole world.",
  "home.about.title": "who we are",
  "home.about.description": "We are a community who ultimately value God. We gather together to passionately worship him, intimately seek his face and go out and boldly represent his kingdom in all spheres of influence. If you share this passion, Please come join us in these times.",
  "home.about.schedule.title": "come join us!",
  "home.about.schedule.wed-time": "WEDNESDAYS FROM 6PM TO 8PM",
  "home.about.schedule.wed-title": "worship and teaching and fellowship",
  "home.about.schedule.sun-time": "SUNDAYS FROM 10AM TO 1:30PM",
  "home.about.schedule.sun-title": "worship, word of god and fellowship",
  "home.forign-links.store": "visit our store",
  "home.forign-links.store-description": "This is the season for us to rise up and run like never before! Preach the gospel like never before, Plant churches like never before, and disciple generations like never before, It's time for us to work, and we invite you to work with us. \n\n Commercial Bank: 1000217803776 Berhan International Bank 1600050000776",
  "home.forign-links.store-btn": "Shop Now",
  "home.forign-links.tv": "live",
  "home.forign-links.tv-description": "Even if you can't attend our services physically, thanks to modern technology, You can always be part of our Online Community.",
  "home.forign-links.tv-btn": "Join Live",
  "home.quad-links.youth": "youth",
  "home.quad-links.kids": "kids",
  "home.quad-links.worship": "worship",
  "home.quad-links.actofkindness": "act of kindness",
  "home.events.title": "events",
  "home.events.btn": "See All Events",
  "home.media.blog-title": "blog",
  "home.media.blog-btn": "Read Articles",
  "home.media.podcasts-title": "podcasts",
  "home.media.podcasts-btn": "Listen to Podcasts",
  "home.media.videos-title": "videos",
  "home.media.videos-btn": "Play Video Series",
  "blog.title": "blog",
  "blog.featured": "Featured Blog Post",
  "blog-other": "Other",
  "blog-all": "All",
  "blog-name": "Blog Post",
  "blog-single": "",
  "blog-many": "s",
  "blog-similar-posts": "Similar Posts",
  "blog-no-more-found": "No more blog found",
  "blog-blog-found": "No blog found",
  "events.title": "events",
  "events.featured": "Featured Event",
  "events-other": "Other",
  "events-all": "All",
  "events-name": "Event",
  "events-single": "",
  "events-many": "s",
  "event-time": "HAPPENS ON",
  "event-location": "LOCATION",
  "events-no-more-found": "No more events found",
  "events-no-found": "No event found",
  "podcasts.title": "podcasts",
  "podcasts.featured": "Featured Podcast",
  "podcasts-other": "Other",
  "podcasts-all": "All",
  "podcasts-name": "Podcast",
  "podcasts-single": " ",
  "podcasts-many": "s",
  "podcasts-no-more-found": "No more podcast found",
  "podcasts-no-found": "No podcast found",
  "tags.all": "All Tags",
  "tags": "Tags",
  "videos": "Videos",
  "videos.title": "zetseat tv",
  "videos.featured": "Featured Video Series",
  "videos-other": "Other",
  "videos-all": "All",
  "videos-name": "Video series",
  "videos-single": "",
  "videos-many": "s",
  "videos-no-more-found": "No more video series found.",
  "videos-no-found": "No video series found.",
  "videos-episode-no-found": "No episodes found.",
  "video-not-selected": "No episode selected.",
  "open-in-youtube": "Open in YouTube",
  "about-episode": "About Episode",
  "youth.title": "youth at zetseat church",
  "youth.history.title": "zetseat youth (ym4tn)",
  "youth.history.description": "Zetseat Youth is a youth ministry of Zetseat Apostolic Reformation Church. It engages youths who range from high school to professionals below 35 years old. The ministry aims at empowering our youth to become world changers. We host the will of God to bring transformation in schools, cities and nations.",
  "youth.mission.title": "mission statement",
  "youth.mission.description": "To bring transformation through soul winning and by making disciples of schools, cities and nations!",
  "youth.schools.title": "schools",
  "youth.schools.description": "We believe schools are at the heart of God. Holy Spirit is initiating schools to become epic center to host the next mighty move of God. Many are encountering God’s love and power. They are receiving purposes to their life. Souls are being won by the power of God. The best is yet to come!",
  "youth.higherEdu.title": "high schools and higher educations",
  "youth.higherEdu.description": "We strive to impact schools through the preaching of the Gospel of the kingdom of God. We also empower the Christian youth to take their stand in transforming the school culture into the kingdom one. Schools are now to be hit by the righteous wave of the kingdom of God. We can’t wait till high schools become the primary visitation place of the upcoming revival",
  "youth.cities.title": "cities",
  "youth.cities.description": "We work all the kingdoms are subjected to the higher Kingdom. Systems are supposed to be devoured by the system of the eternal as the rod of Aaron swallowed that of the magicians. God is about restoring the systems unto the values of His Kingdom which is peace, righteousness and joy in the Holy Spirit.",
  "youth.professionals.title": "professionals",
  "youth.professionals.description": "The Professionals is one wing of Zetseat Youth in which we work in transforming the city culture. Graduates are empowered with the values of the Kingdom of God and deployed into systems to become salt and light wherever they are.",
  "youth.event.title": "youth events",
  "youth.event.firenight.title": "fire night",
  "youth.event.firenight.description": "Bimonthly event in which we empower the youth to explore their sphere of influence and be inspired to become light and salt in their respective sphere. We have speakers who share their experiences in the real life scenario. We also have panel discussions on the issues to be addressed. To gain the full picture of what it looks like, you better come and attend of this nights and you shall testify it is FIRE in deed!",
  "youth.event.artnight.title": "art night",
  "youth.event.artnight.description": "God is the creator of Art indeed. We host Art Night events once in three month in which we celebrate the goodness of God through different arts and performances. Our youths are encouraged to worship God using their talents and skills. We have poetry, songs, rap, spoken word, stage performance and so more to mention. Again you are so encouraged to come and see how ART can worship God.",
  "youth.event.gospel.title": "gospel month",
  "youth.event.gospel.description": "We have designated two months of the year which are related to the major holidays (Christmas and Passover) for evangelism. Though we make evangelism throughout the year, the gospel months are especially dedicated to proclaim the Gospel in a very intention, powerful and creative way. To mention we have prayer evangelism, media evangelism, ministry evangelism and school & city outreaches.",
  "youth.event.button-text": "Browse Events",
  "youth.innerhealing.title": "holo ministry",
  "youth.innerhealing.description": "Holo ministry is a counsel and prayer for the sanctification and transformation of all Christians. Its a ministry that brings the gospel to those parts of a believer's heart that have not yer fully believed and cooperated with Christ. Its discipline of digging deep, under the guidance of the **Holy Spirit,** to discover whatever roots might be springing back to life, and to bring them to effective death on the cross. Thus, by forgiving and getting free of wounds and lies, creates an environment for a true intimate relationship with the Godhead.",
  "youth.aweakening.title": "awakening conference",
  "youth.aweakening.description": "God has given this revelation while we were praying before Him to show us His heart for teenagers. We have heard of the upcoming revival since from we were kids. But, we never understood when and how it is going to happen.\n\nAren’t His words and promises true? This was the triggering point for such revelation and prophecy to come from heaven and be revealed to us. God of all creation said to us: ‘**the revival that you are waiting for is waiting for you.**’ I know that is really shocking, right? We said, “how come this is true?”\n\nPerhaps, God is looking for the next revivalists. Now we have engaged in raise the next new breed of revivalists. The Awakening Conference is prepared to gather those revivalists and equip them by the Word and Spirit of God.",
  "youth.mission-school.title": "mission school",
  "youth.mission-school.description": "Through history, before God sent His glory and visit the world, He used to fore-send those who would carry the glory or through whom He visits. He calls for people to be sent before He called Himself to visit the world.\n\nHe looks for individuals who are desperate to carry His glory go to the world. A generation who is going to be instruments of God should come first before we see the mighty move of God. **God is looking for a generation to send.**\n\n> “And he sent them to preach the kingdom of God, and to heal the sick.” \n>\n> Luke 9:2\n\nMission School is intended to equip young missionaries who dedicate their life to carry the message of God to the world. It is a platform that empowers young missionaries and equips them with the Word of God and His Spirit. It provides the basic tools how to fulfill the great commission wherever they are.",
  "youth.summercampus.title": "summer camps",
  "youth.summercampus.description": "Summer is like spring board for our youth. It is preparation season in which we are invested in the word and presence of God. We get empowered and equipped for the work of God. We have series of projects we do in the summer:",
  "youth.summercampus.btn": "All Events",
  "youth.ays.title": "ays - annual youth summit ",
  "youth.ays.description": " **The Background**\n\nAnnual Youth Summit is an annual service hosted by the youth ministry of Zetseat Apostolic Reformation Church. The summit is held every year in the city of Addis Ababa, Ethiopia at the end of the year (E.C). Annual Youth Summit was long conceived by prior youth leaders in Zetseat. With the conviction that we alone cannot make difference on the nation, there was a deep desire for unity, country based Christian youth unity, which will be able to overcome national and international problems and mobilize the youth for the kingdom of God.\n\n  **Addressing**\n\nThe vision  Addressing the contemporary young generation with the timely agenda of God\n\n  **The Target**\n\nIn connection with the commencement, the target of annual youth summit in general is to be able to create podium and stage for Christian youth of the world to be able to unite under one commission. For them to join hands together as soldiers of one general by the right understanding of what the timely agenda is. Another notable target is the ability of having one stage where God addresses the generation as one to communicate his timely agenda.\n\n **Its History**\n\nThe history of AYS spans for the past 5 years, from 2015 till 2019. Each AYS was hosted in a specific theme that coherently addressed the youth and God’s timely agenda. \n\n* **AYS|2017**, Theme: ‘**ADVANCE**’.\n* **AYS | 2018**, Theme: ‘**FIRE-BRAND - youth for youth**’\n* **AYS | 2019**, **Grand AYS**, Theme: **Flood**",
  "youth.ays.btn": "Learn About AYS",
  "kids.title": "zetseat children ministry",
  "kids.passion.description": "We are passionate about equipping parents to take their rightful place as teachers, good examples and representatives of Christ in their homes in raising the future leaders and game changers. \n",
  "kids.passion.title": "our passion",
  "kids.purpose.description": "Our purpose is to raise children who imitate christ, have an intimate personal relationship with their Heavenly Father based on encounter and a strong base in the word of God.\n",
  "kids.purpose.title": "our purpose",
  "kids.class.title": "our sunday school classes",
  "kids.class-1": "Class One",
  "kids.class-1.title": "creation",
  "kids.class-1.age": "Age 3 & 4",
  "kids.class-2": "Class Two",
  "kids.class-2.title": "my bible",
  "kids.class-2.age": "Age 5 & 6 – KG2 & Prep",
  "kids.class-3": "Class Three",
  "kids.class-3.title": "the cross",
  "kids.class-3.age": "Age 7 & 8 – Grade 1 & Grade 2",
  "kids.class-4": "Class Four",
  "kids.class-4.title": "christian",
  "kids.class-4.age": "Age 9 & 10 – Grade 3 & Grade 4",
  "kids.class-5": "Class Five",
  "kids.class-5.title": "impact",
  "kids.class-5.age": "Age 11 & 12 – Grade 5 & Grade 6",
  "kids.quote.description": "It takes a generation, to raise a generation",
  "kids.quote.by": "Apostle Yohannes Girma",
  "about.title": "",
  "about.history.title": "history of zetseat apostolic reformation church",
  "about.history": "The history of the church is strongly related to the divine encounter that the founder of the church, Apostle Yohannes Girma had. After his life was changed by God’s visitation on April of 1994, he started preparing himself for ministry for the mission he received to raise a generation. Then God helped him to win many souls and opened doors in relation to the reformation movement initiated in the country. While he was ministering to the generation whom God gave him with other brethren, he mainly focused on preparing himself by doing his first degree at a theological college. Hereafter, by communicating with the leaders of the reformation movement which he himself established and by receiving their blessing, he went out to serve the vision that God gave him by divine guidance. With him also went out some of those who received Christ through him and were taught by him. These include: Meaza Befekadu (Prophetess), Addis Tesfu (Pastor), Birtukan H/Meskel (Evangelist), Daniel Hailu (Pastor), Eden Hailu (Pastor) and Paulos Girma. The Apostle was known for his music and worship ministry; therefore, he and the ministers with him started ministering as a choir in many churches. He also started making disciples of the young people he met in different incidents. The ministry began to grow. The counseling and fellowship times which used to be held in cafes started to gradually move to individuals’ houses. Finally, the need for renting a place emerged as an issue and the ministry continued in a rented house around an area called *Cherqos.*<br/><br/>In addition to the choir ministry what accelerated the growth and influence of the church was the *students’ ministry*. In the high school ministry the lives of many youngsters were transformed. Specially the student movements in Dandiiboru, Saint Joseph and later Cathedral Schools are iconic examples. And also, the college students ministry also helped the transformation of many lives.<br/><br/> Following the expansion of the ministry, they moved out from *Cherqos area* to a temporarily built building around *Bulgaria area*. During these times, the prophetic worship programs held in Exhibition Center, the following DVD albums of the choir and the prayer and intercession programs held for two consecutive years in Addis Ababa Stadium played a significant role in widening the sphere of influence of the church and building its international reputation.<br/><br/> One more area the ministry thrived in was the family revival. By receiving a guidance from God, the Apostle started teaching on marriage. And as God spoke to him and as never seen before within a few years hundreds of young men and women were blessed with successful marriages through wisdom and knowledge. This contributed a great deal to the growth of the church.<br/><br/> The church planted local churches during these times in two different towns namely Mekelle (2009) and Hossana (2010). Young missionaries were sent to these local churches; hence the souls of many young people were saved and the churches grew to be influential in those towns.<br/><br/> Due to the fast growth of the church and the need of a place that fits the vision, the church started fundraising and looking for places. In the first fundraising program, around 5 million ETB was collected from the few young people in the congregation. After searching for places, the church settled on the place where it is now. It was initially rented but by the conviction of buying it, it was built and made ready for service within a short period of time by the members’ incredible participation in the physical construction of the building.<br/><br/> Through continuous fundraising programs and the loan obtained from Berhan International Bank, the compound in which the worship hall is found was bought. In 2019, the church paid the bank loan completely and owned it fully. Currently the mother church has under her five local branches in Ethiopia and 3 fellowships abroad.",
  "about.vision.title": "vision",
  "about.vision.description": "To see a generation suitable to God risen in the whole world.",
  "about.core.title": "core values",
  "about.vision-1": "Our God is supernatural.",
  "about.vision-2": "The salvation of everyone is the desire & good will of God.",
  "about.vision-3": "A Godly family is the foundation of a Godly generation.",
  "about.vision-4": "We are created by God for a Purpose.",
  "about.vision-5": "Time is a precious gift from God for a purpose.",
  "about.mission.title": "mission",
  "about.mission.description": "To bring holistic righteous impact that will expand the kingdom of\nGod through the heavenly visitation at hand and the one to come.",
  "about.statement.title": "statement of faith",
  "about.leader.title": "leaders",
  "email.sub.title": "subscribe",
  "email.sub.description": "Register your email with us to receive updates.",
  "email.sub.placeholder": "Your email",
  "email.sub.btn": "Register",
  "search-field.placeholder": "search",
  "btn.readmore": "Read More",
  "btn.know.more": "Know More",
  "share": "share",
  "download": "Download",
  "page-not-found.title": "404! Not found.",
  "page-not-found.message": "Seems like you just hit a route that doesn/'t exist.",
  "page-not-found.link": "Go home"
}
